 IDENTIFICATION DIVISION.
 PROGRAM-ID. RELEMPTY.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMETEXT PIC X(20).
 PROCEDURE DIVISION.
    IF SOMETEXT = SPACE
       DISPLAY 'test'
    END-IF.