 IDENTIFICATION DIVISION.
 PROGRAM-ID. MOVETOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOME-NUMBER1 PIC 999 COMP VALUE ZEROS.
 01 SOME-NUMBER2 PIC 9(3) VALUE ZEROS.
 01 SOME-ANUM1 PIC X(3) VALUE SPACES.
 01 SOME-ANUM2 PIC X(4) VALUE SPACES.
 01 SOME-RED REDEFINES SOME-ANUM2 PIC 9(3).
 
 PROCEDURE DIVISION.
     MOVE 'Alphanumeric' TO SOME-ANUM1.
     MOVE SOME-ANUM1 TO SOME-NUMBER1.
     MOVE 'Alphanumeric' TO SOME-NUMBER2.
     MOVE SOME-ANUM1 TO SOME-ANUM2.
     MOVE 1 TO SOME-RED.
     MOVE SOME-RED TO SOME-NUMBER1.