 IDENTIFICATION DIVISION.
 PROGRAM-ID. MOVETOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOME-TEXT PICTURE IS X(4).
 PROCEDURE DIVISION.
     MOVE "Test" TO SOME-TEXT.
     MOVE "Testing" TO SOME-TEXT.