 IDENTIFICATION DIVISION.
 PROGRAM-ID. MOVETOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOME-NUMBER2 PIC 9V9.
 PROCEDURE DIVISION.
     MOVE 1.4 TO SOME-NUMBER2.
     MOVE 1.41 TO SOME-NUMBER2.
     MOVE 15.4 TO SOME-NUMBER2.