 IDENTIFICATION DIVISION.
 PROGRAM-ID. MOVETOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOME-NUMBER PIC 999 COMP.
 PROCEDURE DIVISION.
     MOVE 111 TO SOME-NUMBER.
     MOVE 1111 TO SOME-NUMBER.