 IDENTIFICATION DIVISION.
 PROGRAM-ID. ADDSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEVALUE1 PIC 9(10).
 01 SOMEVALUE2 PIC 9(10).
 01 SOMEVALUE3 PIC 9(10) COMP-1.
 01 SOMEVALUE4 PIC 9(10) COMP-2.
 01 SOMEVALUE5 PIC 9(10) COMP-3.
 01 SOMEVALUE6 PIC 9(10) COMP-4.
 01 SOMEVALUE7 PIC 9(10) COMP-5.
 01 SOMEVALUE8 PIC 9(10) BINARY.
 PROCEDURE DIVISION.
    COMPUTE SOMECOMPUTE = SOMEVALUE1  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE2  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE3  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE4  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE5  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE6  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE7  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE8  * 10.
    COMPUTE SOMECOMPUTE = SOMEVALUE1 / SOMEVALUE2.
    COMPUTE SOMECOMPUTE = SOMEVALUE2 / SOMEVALUE3.
    COMPUTE SOMECOMPUTE = SOMEVALUE3 / SOMEVALUE4.
    COMPUTE SOMECOMPUTE = SOMEVALUE4 / SOMEVALUE5.
    COMPUTE SOMECOMPUTE = SOMEVALUE5 / SOMEVALUE6.
    COMPUTE SOMECOMPUTE = SOMEVALUE6 / SOMEVALUE7.
    COMPUTE SOMECOMPUTE = SOMEVALUE7 / SOMEVALUE8.
    COMPUTE SOMECOMPUTE = SOMEVALUE1 + SOMEVALUE2.
    COMPUTE SOMECOMPUTE = SOMEVALUE2 + SOMEVALUE3.
    COMPUTE SOMECOMPUTE = SOMEVALUE3 + SOMEVALUE4.
    COMPUTE SOMECOMPUTE = SOMEVALUE4 + SOMEVALUE5.
    COMPUTE SOMECOMPUTE = SOMEVALUE5 + SOMEVALUE6.
    COMPUTE SOMECOMPUTE = SOMEVALUE6 + SOMEVALUE7.
    COMPUTE SOMECOMPUTE = SOMEVALUE7 + SOMEVALUE8.
    COMPUTE SOMECOMPUTE = SOMEVALUE1 - SOMEVALUE2.
    COMPUTE SOMECOMPUTE = SOMEVALUE2 - SOMEVALUE3.
    COMPUTE SOMECOMPUTE = SOMEVALUE3 - SOMEVALUE4.
    COMPUTE SOMECOMPUTE = SOMEVALUE4 - SOMEVALUE5.
    COMPUTE SOMECOMPUTE = SOMEVALUE5 - SOMEVALUE6.
    COMPUTE SOMECOMPUTE = SOMEVALUE6 - SOMEVALUE7.
    COMPUTE SOMECOMPUTE = SOMEVALUE7 - SOMEVALUE8.
    IF SOMEVALUE1 = SOMEVALUE2 THEN
    	   DISPLAY "EQUAL".
    	
    
    
    
    