 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETHROUGH.
 DATA DIVISION.
 FILE SECTION.
 FD FILE1. 
 01 SOME-VALUE PIC 9 VALUE 0.
 PROCEDURE DIVISION.
 OPEN-STATEMENT.
    OPEN INPUT FILE1.
 PERFORM-THRU-STATEMENT.
 	PERFORM OPEN-STATEMENT THRU PERFORM-THRU-OUTOFLINE-STATEMENT.
 PERFORM-UNTIL-STATEMENT.
     PERFORM UNTIL SOME-VALUE > 0
     	OPEN INPUT FILE1
     END-PERFORM.
 PERFORM-TIMES-STATEMENT.
     PERFORM 3 TIMES
     	OPEN INPUT FILE1
     END-PERFORM.
 PERFORM-VARYING-STATEMENT.
 	PERFORM VARYING A FROM 1 BY 1 UNTIL A = 3
     	OPEN INPUT FILE1
     END-PERFORM.