 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETHROUGH.
 PROCEDURE DIVISION.
 INIT.
     PERFORM PROC1 THROUGH PROC3.
     STOP RUN.
 PROC1.
     PERFORM PROC2.
 PROC2.
     PERFORM PROC4.
 PROC3.
     Display "Proc3".
 PROC4.
     PERFORM PROC1.