 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETHROUGH.
 PROCEDURE DIVISION.
 INIT.
    PERFORM PROC1.
 PROC1.
    PERFORM PROC6.
 PROC2.
    PERFORM PROC1.
 PROC3.
 	PERFORM PROC2.
 PROC4.
    PERFORM PROC3.
 PROC5.
 	PERFORM PROC6.
 PROC6.
 	PERFORM PROC4.	
 PROC7.
 PROC8.
 	PERFORM PROC7.
 PROC9.
 	PERFORM PROC10.
 PROC10.
 	PERFORM PROC11.
 PROC11.
 	PERFORM PROC12.
 PROC12.
 	PERFORM PROC13.
 PROC13.
 	PERFORM PROC14.
 PROC14.
 	DISPLAY "HELLO".