 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETHROUGH.
 PROCEDURE DIVISION.
 INIT.
     PERFORM PROC1 THROUGH PROC4.
     PERFORM PROC1 THROUGH PROC3.
     PERFORM PROC1 THROUGH PROC2.
     PERFORM PROC5.
     STOP RUN.
 PROC1.
     Display "Proc1".
 PROC2.
     Display "Proc2".
 PROC3.
 	 PERFORM TEST-SECTION.
     Display "Proc3".
     EXIT.
 PROC4.
     EXIT.
 PROC5.
 	 Display "Proc5".
 PROC6.
 TEST-SECTION SECTION.