 IDENTIFICATION DIVISION.
 PROGRAM-ID. EMPTY.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  COUNTER PIC 9(8).
 LINKAGE SECTION.
 01 MY_VAR PIC 9(1).
 PROCEDURE DIVISION.
 INIT SECTION.
  PERFORM SOME-PARAGRAPH.
  PERFORM SOME-SECTION-B.
 SOME-SECTION-A SECTION.
 SOME-SECTION-B SECTION.
  GO TO SOME-SECTION-C.
 SOME-SECTION-C SECTION.
  PERFORM SOME-SECTION-A.
 SOME-SECTION-D SECTION.
 SOME-PARAGRAPH.
  Display "TEST".