 IDENTIFICATION DIVISION.
 PROGRAM-ID. GOTOSTMT.
 PROCEDURE DIVISION.
 MAIN-PARA.
    Display "Path0".
    Go To PARA-1.
    Display "Path1".
    Stop Run.
 PARA-1.
    Display "Path2".
