 IDENTIFICATION DIVISION.
 PROGRAM-ID. TOOMANYSECTIONS.
 PROCEDURE DIVISION.
 SOME-SECTION-A SECTION.
 SOME-SECTION-B SECTION.
 SOME-SECTION-C SECTION.
 SOME-SECTION-D SECTION.
 SOME-SECTION-E SECTION.
 SOME-SECTION-F SECTION.
 SOME-SECTION-G SECTION.
 SOME-SECTION-H SECTION.
 SOME-SECTION-I SECTION.
 SOME-SECTION-J SECTION.
 SOME-SECTION-K SECTION.
 SOME-SECTION-L SECTION.
 SOME-SECTION-M SECTION.
