 IDENTIFICATION DIVISION.
 PROGRAM-ID. TOOMANYSECTIONS.
 PROCEDURE DIVISION.
 SOME-SECTION-A SECTION.
 SOME-SECTION-B SECTION.
 SOME-SECTION-C SECTION.
 SOME-SECTION-D SECTION.
 SOME-SECTION-E SECTION.
 SOME-SECTION-F SECTION.
 SOME-SECTION-G SECTION.
 SOME-SECTION-H SECTION.
 SOME-SECTION-I SECTION.
 SOME-SECTION-J SECTION.
 SOME-SECTION-K SECTION.
 SOME-SECTION-L SECTION.
 SOME-SECTION-M SECTION.
 SOME-SECTION-N SECTION.
 SOME-SECTION-O SECTION.
 SOME-SECTION-P SECTION.
 SOME-SECTION-Q SECTION.
 SOME-SECTION-R SECTION.
 SOME-SECTION-S SECTION.
 SOME-SECTION-T SECTION.
 SOME-SECTION-U SECTION.
 SOME-SECTION-V SECTION.
 SOME-SECTION-W SECTION.
 SOME-SECTION-X SECTION.
 SOME-SECTION-Y SECTION.
 SOME-SECTION-Z SECTION.
