 IDENTIFICATION DIVISION.
 PROGRAM-ID. EMPTY.
 PROCEDURE DIVISION.
 SOME-SECTION-A SECTION.
 SOME-SECTION-B SECTION.
 SOME-SECTION-C SECTION.
 SOME-SECTION-D SECTION.
 SOME-SECTION-B SECTION.
 SOME-SECTION-D SECTION.
 
