 IDENTIFICATION DIVISION.
 PROGRAM-ID. EMPTY.
 PROCEDURE DIVISION.
 SOME-SECTION-A SECTION.
 SOME-PARAGRAPH-A.
 	DISPLAY "SOME-PARAGRAPH-A".
 SOME-PARAGRAPH-AA.
 SOME-SECTION-B SECTION.
 SOME-PARAGRAPH-B.
 	DISPLAY "SOME-PARAGRAPH-B".	
 SOME-SECTION-C SECTION.
 SOME-PARAGRAPH-C.
 	DISPLAY "SOME-PARAGRAPH-C".
 SOME-PARAGRAPH-CC.
 	EXIT.
 SOME-SECTION-D SECTION.
 SOME-PARAGRAPH-D.
 	DISPLAY "SOME-PARAGRAPH-D".
 SOME-PARAGRAPH-DD.
 	DISPLAY "SOME-PARAGRAPH-DD".
 	EXIT.
 SOME-SECTION-E SECTION.
 SOME-PARAGRAPH-E.
 	STOP RUN.
 SOME-SECTION-F SECTION.
 SOME-PARAGRAPH-F.
 	DISPLAY "SOME-PARAGRAPH-F".
 SOME-PARAGRAPH-FF.
 	GOBACK.
 SOME-SECTION-G SECTION.
 SOME-PARAGRAPH-G.
 	DISPLAY "SOME-PARAGRAPH-G".
 SOME-PARAGRAPH-GG.
 	DISPLAY "SOME-PARAGRAPH-GG".
 	GO BACK.
