 IDENTIFICATION DIVISION.
 PROGRAM-ID. MOVETOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOME-DATA.
 	02 SOME-DATA2. 
 		03 SOME-NUMBER PIC 99 VALUE 0.
 		03 SOME-NUMBER2 PIC 99 VALUE 3.
 	02 SOME-TEXT PICTURE IS X(9).
 PROCEDURE DIVISION.
     MOVE 1 TO SOME-NUMBER OF SOME-DATA2 OF SOME-DATA.
     MOVE "TEXT" TO SOME-TEXT OF SOME-DATA.
     MOVE 1 TO SOME-NUMBER2.
	 EVALUATE SOME-NUMBER OF SOME-DATA2 OF SOME-DATA
     	WHEN 0 THROUGH 2 DISPLAY SOME-NUMBER
     	WHEN OTHER DISPLAY SOME-NUMBER2
     END-EVALUATE.
     EVALUATE SOME-NUMBER OF SOME-DATA2
       WHEN 0 THROUGH 2 DISPLAY SOME-NUMBER
       WHEN OTHER DISPLAY SOME-NUMBER2
     END-EVALUATE.
     EVALUATE SOME-NUMBER OF SOME-DATA2 ALSO SOME-NUMBER2 OF SOME-DATA2
       WHEN 0 THROUGH 2 DISPLAY SOME-NUMBER
       WHEN OTHER DISPLAY SOME-NUMBER2
     END-EVALUATE.
     