 IDENTIFICATION DIVISION.
 PROGRAM-ID. INSPCTSTMT.
 
 DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-CNT PIC 9(2) VALUE 0.
   01 WS-STRING PIC X(15) VALUE 'AAAABCCCDDEEEEE'.

 PROCEDURE DIVISION.
    INSPECT WS-STRING 
       TALLYING WS-CNT FOR
          ALL 'C' BEFORE INITIAL 'D'
       REPLACING
          CHARACTERS BY 'B' AFTER INITIAL 'A'.