 IDENTIFICATION DIVISION.
 PROGRAM-ID. INSPCONV.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 WS-DATA1 PIC X(10) VALUE 'mainframes'.
 01 WS-DATA2 PIC X(10) VALUE 'test'.
 PROCEDURE DIVISION.
    INSPECT WS-DATA1 CONVERTING "abcdefghijklmnopqrstuvwxyz" TO "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
    INSPECT WS-DATA2 CONVERTING "abcde" TO "ABCDE".
    DISPLAY 'DATA AFTER CONVERTING : 'WS-DATA1.
    STOP RUN.