 IDENTIFICATION DIVISION.
 PROGRAM-ID. INSPCTSTMT.

 DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-CNT1 PIC 9(2) VALUE 0.
   01 WS-CNT2 PIC 9(2) VALUE 0.
   01 WS-CNT3 PIC 9(2) VALUE 0.
   01 WS-CNT4 PIC 9(2) VALUE 0.
   01 WS-CNT5 PIC 9(2) VALUE 0.
   01 WS-CNT6 PIC 9(2) VALUE 0.
   01 WS-CNT7 PIC 9(2) VALUE 0.
   01 WS-CNT8 PIC 9(2) VALUE 0.
   01 WS-STRING1 PIC X(15) VALUE 'ABCDACDADEAAAFF'.
   01 WS-STRING2 PIC X(15) VALUE 'AAAABCCCDDEEEEE'.

 PROCEDURE DIVISION.
   INSPECT WS-STRING1 TALLYING WS-CNT1 FOR CHARACTER.
   DISPLAY "WS-CNT1 : "WS-CNT1.

   INSPECT WS-STRING2 TALLYING WS-CNT2 FOR CHARACTER BEFORE 'B'.
   DISPLAY "WS-CNT2 : "WS-CNT2.
 
   INSPECT WS-STRING2 TALLYING WS-CNT3 FOR CHARACTER AFTER 'B'.
   DISPLAY "WS-CNT3 : "WS-CNT3.
 
   INSPECT WS-STRING1 TALLYING WS-CNT4 FOR ALL 'A'.
   DISPLAY "WS-CNT4 : "WS-CNT4.
  
   INSPECT WS-STRING2 TALLYING WS-CNT5 FOR LEADING 'A'.
   DISPLAY "WS-CNT5 : "WS-CNT5.

   INSPECT WS-STRING2 TALLYING WS-CNT6 FOR LEADING 'D' BEFORE 'E'.
   DISPLAY "WS-CNT6 : "WS-CNT6.

   INSPECT WS-STRING2 TALLYING WS-CNT7 FOR LEADING 'A' BEFORE 'E'.
   DISPLAY "WS-CNT7 : "WS-CNT7.
   
   INSPECT WS-STRING2 TALLYING WS-CNT8 FOR LEADING 'C' AFTER 'B'.
   DISPLAY "WS-CNT8 : "WS-CNT8.