 IDENTIFICATION DIVISION.
 PROGRAM-ID. INSPCTSTMT.
 DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-STRING1 PIC X(10) VALUE 'AAAABBBCCD'.
   01 WS-STRING2 PIC X(10) VALUE 'AAAABBBCCD'.
   01 WS-STRING3 PIC X(10) VALUE 'AAAABBBCCD'.
   01 WS-STRING4 PIC X(10) VALUE 'AAAABBBCCD'.
   01 WS-STRING5 PIC X(10) VALUE 'AAAABBBCCD'.
 PROCEDURE DIVISION.
    INSPECT WS-STRING1 REPLACING CHARACTER BY 'E'.
    INSPECT WS-STRING2 REPLACING CHARACTERS BY 'E' AFTER INITIAL 'B'.
    INSPECT WS-STRING3 REPLACING ALL 'C' BY 'E'.
    INSPECT WS-STRING4 REPLACING FIRST 'C' BY 'E'.
    INSPECT WS-STRING5 REPLACING LEADING 'A' BY 'E'.