 IDENTIFICATION DIVISION.
 PROGRAM-ID. MULTSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 23.
 77 SOMEID2 PIC 9(10) VALUE 42.
 PROCEDURE DIVISION.
    MULTIPLY 2 BY SOMEID1 SOMEID2.