 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 GROUP1.
   05 A PIC 99 VALUE 1.
   05 C PIC 99 VALUE 3.
   05 E PIC 99 VALUE 5.
 01 GROUP2 PIC 9(10).
   05 A PIC 99 VALUE 10.
   05 B PIC 99 VALUE 20.
   05 C PIC 99 VALUE 30.
   05 D PIC 99 VALUE 40.
   05 E PIC 99 VALUE 50.
 PROCEDURE DIVISION.
     SUBTRACT CORR GROUP1 FROM GROUP2.