 IDENTIFICATION DIVISION.
 PROGRAM-ID. DIVSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 1000.
 77 SOMEID2 PIC 9(10) VALUE 1000.
 PROCEDURE DIVISION.
    DIVIDE 2 INTO 42 GIVING SOMEID1 SOMEID2.