 IDENTIFICATION DIVISION.
 PROGRAM-ID. LKGSCTENTRYWTHVAL.
 DATA DIVISION.
 LINKAGE SECTION.
 01 SOME-DATA PIC X(20) VALUE IS "SOME-STRING".   *> Noncompliant
 01 OTHER-DATA PIC X(20) VALUE IS "OTHER-STRING".
 01 GENDER PIC X.
     88  MALE   VALUE "M". *> Compliant; this is a condition name
     88  FEMALE VALUE "F".