 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 23.
 77 SOMEID2 PIC 9(10) VALUE 1000.
 77 SOMEID3 PIC 9(10) VALUE 1000.
 PROCEDURE DIVISION.
     SUBTRACT 1 2 FROM SOMEID1 GIVING SOMEID2 SOMEID3.