 IDENTIFICATION DIVISION.
 PROGRAM-ID. READSTMT.
 DATA DIVISION.
    FILE SECTION.
       FD OUTFILE1
           BLOCK CONTAINS 5 RECORDS.
       FD OUTFILE2
           BLOCK CONTAINS 0 RECORDS.
       FD OUTFILE3
           BLOCK CONTAINS 5 CHARACTERS.
       FD OUTFILE4
           BLOCK CONTAINS 0 CHARACTERS.