 IDENTIFICATION DIVISION.
 PROGRAM-ID. READSTMT.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT SOMEFILE1 ASSIGN TO 'somefile1.txt'.
          SELECT FILE_1 ASSIGN TO 'Test'.
          SELECT FILE-1 ASSIGN TO '!'.
          SELECT SOMEFILE2 ASSIGN TO FC-I1.
          SELECT FILE-2 ASSIGN TO FC_S1.