 IDENTIFICATION DIVISION.
 PROGRAM-ID. ADDSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 TEST1 PIC 9(10) VALUE 3.
 77 TEST2 PIC 9(10) VALUE 1000.
 PROCEDURE DIVISION.
     ADD 1 TO TEST1 GIVING TEST2.
