 IDENTIFICATION DIVISION.
 PROGRAM-ID. HELLO.

 ENVIRONMENT DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
   SELECT PERSON ASSIGN TO IN1
      ORGANIZATION IS INDEXED
      ACCESS IS RANDOM
      RECORD KEY IS PERSON-ID
      FILE STATUS IS FS.

 DATA DIVISION.
 FILE SECTION.
 FD PERSON.
 01 PERSON-FILE.
   05 PERSON-ID PIC 9(4).
   05 NAME PIC A(12).
   05 GENDER PIC X(1).

 WORKING-STORAGE SECTION.
 01 WS-PERSON.
   05 WS-PERSON-ID PIC 9(5).
   05 WS-NAME PIC A(25).
   05 WS-GENDER PIC X(1).

 PROCEDURE DIVISION.
   OPEN I-O PERSON.
   MOVE '2345' TO PERSON-ID.

   READ PERSON KEY IS PERSON-ID 
      INVALID KEY 
         DISPLAY 'KEY IS NOT EXISTING'
   END-READ.

   MOVE 'Bush' TO NAME.
   REWRITE PERSON-FILE
   END-REWRITE.
   CLOSE PERSON.
   STOP RUN.