 IDENTIFICATION DIVISION.
 PROGRAM-ID. DISPLAYATSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PICTURE IS X(9).
 77 SOMEID2 PICTURE IS X(1).
 PROCEDURE DIVISION.
    DISPLAY SOMEID1 '2' AT SOMEID2.