 IDENTIFICATION DIVISION.
 PROGRAM-ID. NOTTOOMANYPARAGRAPHS.
 PROCEDURE DIVISION.
 SOME-SECTION-1 SECTION.
 SOME-PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME-PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME-SECTION-2 SECTION.
 SOME-PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME-PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME-SECTION-3 SECTION.
 SOME-PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME-PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.
 SOME_PARAGRAPH.