 IDENTIFICATION DIVISION.
 PROGRAM-ID. UNCALLEDPARAGRAPH.
 PROCEDURE DIVISION.
 SOME-SECTION-A SECTION.
 SOME-PARAGRAPH-A.
     DISPLAY "SOME-TEXT".
 SOME-PARAGRAPH-B.
 SOME-SECTION-B SECTION.
 	DISPLAY "SOME-TEXT".
 SOME-PARAGRAPH-C.
 SOME-PARAGRAPH-D.
 	DISPLAY "SOME-TEXT".