 IDENTIFICATION DIVISION.
 PROGRAM-ID. ADDSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 TEST1 PIC 9(10).
 PROCEDURE DIVISION.
 MAIN_PARAGRAPH.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.  
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
     ADD 1 TO TEST1.
 