 IDENTIFICATION DIVISION.
 PROGRAM-ID. REDEFINEDPARAGRAPH.
 PROCEDURE DIVISION.
 INIT.
     STOP RUN.
 INIT.
     STOP RUN.
 TEST1.
 	STOP RUN.
 SOME_SECTION1 SECTION.
 	TEST1.
 SOME_SECTION2 SECTION.
    TEST1.
    INIT.
 SOME_SECTION3 SECTION.
    TEST3.
    TEST3.
  