 IDENTIFICATION DIVISION.
 PROGRAM-ID. RELEQ.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
    01 SOMEID1 PIC 9(20).
 PROCEDURE DIVISION.
    IF 1 EQUAL 1 THEN END-IF.