* A Comment line                                   
 IDENTiFICaTION Division.                                         
 Program-ID.                                                      
  HELLOWORLD.                                                     
 Procedure Division.                                                              
  Display "Hello world".                                           
  STOP RUN.                                                       