 IDENTIFICATION DIVISION.
 PROGRAM-ID. ACCPT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 ACCPT1 PIC X(10).
 77 ACCPT2 PIC X(10).
 77 ACCPT3 PIC X(10).
 77 ACCPT4 PIC X(10).
 77 ACCPT5 PIC X(10).
 77 ACCPT6 PIC X(10).
 77 ACCPT7 PIC X(10).
 77 ACCPT8 PIC X(10).
 77 ACCPT9 PIC X(10).
 77 ACCPT10 PIC X(10).
 77 ACCPT11 PIC X(10).
 77 ACCPT12 PIC X(10).
 77 ACCPT13 PIC X(10).
 PROCEDURE DIVISION.

    ACCEPT ACCPT1 FROM DATE.
    DISPLAY ACCPT1.
 
    ACCEPT ACCPT2 FROM DATE YYYYMMDD.
    DISPLAY ACCPT2.

    ACCEPT ACCPT3 FROM DAY.
    DISPLAY ACCPT3.
    
    ACCEPT ACCPT4 FROM DAY YYYYDDD.
    DISPLAY ACCPT4.
    
    ACCEPT ACCPT5 FROM DAY_OF_WEEK.
    DISPLAY ACCPT5.
    
    ACCEPT ACCPT6 FROM TIME.
    DISPLAY ACCPT6.
    
    ACCEPT ACCPT7 FROM TIMER.
    DISPLAY ACCPT7.
    
    ACCEPT ACCPT8 FROM TODAYS-DATE.
    DISPLAY ACCPT8.
    
    ACCEPT ACCPT9 FROM TODAYS-DATE MMDDYYYY.
    DISPLAY ACCPT9.
    
    ACCEPT ACCPT10 FROM TODAYS-NAME.
    DISPLAY ACCPT10.
    
    ACCEPT ACCPT11 FROM YEAR.
    DISPLAY ACCPT11.
    
    ACCEPT ACCPT12 FROM YYYYMMDD.
    DISPLAY ACCPT12.
    
    ACCEPT ACCPT13 FROM YYYYDDD.
    DISPLAY ACCPT13.