 IDENTIFICATION DIVISION.
 PROGRAM-ID. ACCPT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 ACCPT1 PIC X(10).
 PROCEDURE DIVISION.
    ACCEPT ACCPT1.
    DISPLAY ACCPT1.