 IDENTIFICATION DIVISION.
 PROGRAM-ID. STOPRUNNOTLAST.
 PROCEDURE DIVISION.
 STOP RUN.
 DISPLAY "test".
 INIT.
     STOP RUN.
     EXIT PROGRAM.
     DISPLAY "Hello World".
 SOME-SECTION SECTION.
    GOBACK.
    DISPLAY "Hello World".