 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETIMES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 WS-SOMEDATA1 PIC 99 VALUE 20.
 PROCEDURE DIVISION.
   PERFORM PROC1 
     2 TIMES.
   PERFORM PROC1 
     WS-SOMEDATA1 TIMES.
   PROC1.
     DISPLAY 'test'.
     EVALUATE SOMEAGE ALSO SOMEAGE2 ALSO SOMEAGE3
        WHEN 0 THROUGH 25 PERFORM SOMEPROC1
        WHEN 25 THROUGH 50 PERFORM SOMEPROC2
        WHEN 50 THROUGH 74 ALSO 75 PERFORM SOMEPROC3
        WHEN OTHER PERFORM SOMEPROC4
     END-EVALUATE.