 IDENTIFICATION DIVISION.
 PROGRAM-ID. DUPLIT.
 PROCEDURE DIVISION.
    DISPLAY "NON-COMPLIANT1".
    DISPLAY "NON-COMPLIANT2".
    DISPLAY "NON-COMPLIANT1".
    DISPLAY "NON-COMPLIANT2".
    DISPLAY "NON-COMPLIANT1".
    DISPLAY "COMPLIANT".
    DISPLAY 1.
    DISPLAY 1.
    DISPLAY 2.