 IDENTIFICATION DIVISION.
 PROGRAM-ID. DIVSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 10.
 PROCEDURE DIVISION.
    DIVIDE SOMEID1 BY 2.