 IDENTIFICATION DIVISION.
 PROGRAM-ID. DIVSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10).
 PROCEDURE DIVISION.
    DIVIDE 10 BY 5 GIVING SOMEID1.