  IDENTIFICATION DIVISION.
 PROGRAM-ID. NOREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 VARS.
 	05 VAR1 PIC 99 BINARY.
 	05 VAR2 PIC X(8) COMP-4.
 	05 VAR3 PIC X(8) COMP.
 	05 VAR4 PIC X(8) COMP-5.	
 	05 TABLE1 OCCURS 10 TIMES.
 PROCEDURE DIVISION.
 MOVE VAR1 TO TABLE1 (VAR2).
 MOVE VAR1 TO TABLE1 (VAR1).
 MOVE VAR1 TO TABLE1 (VAR3).
 MOVE VAR1 TO TABLE1 (VAR4).
 
 