  IDENTIFICATION DIVISION.
 PROGRAM-ID. NOREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 VARS.
 	05 SIZE1 PIC 99 BINARY.
 	05 SIZE2 PIC X(8) COMP-4.
 	05 TABLE1 OCCURS 1 TO 100
 		DEPENDING ON SIZE1
 		PIC V9. 
 	05 TABLE2 OCCURS 1 TO 100
 		DEPENDING ON SIZE2
 		PIC V9.
 LINKAGE SECTION.
 01 VARS.
 	05 SIZE3 PIC 99 COMP.
 	05 SIZE4 PIC 9(4) COMP-5.
 	05 TABLE3 OCCURS 1 TO 100 DEPENDING ON SIZE3 PIC V9.
 	05 TABLE4 OCCURS 4 TIMES PIC 9(5).
 	05 TABLE5 OCCURS 1 TO 5 DEPENDING ON SIZE4 PIC X(10).