 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCRREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEVALUE1 PIC 9(10).
 01 SOMEVALUE2 PIC 9(10).
 01 SOMEVALUE3 PIC 9(10) COMP-1.
 01 SOMEVALUE4 PIC 9(10) COMP-2.
 01 SOMEVALUE5 PIC 9(10) COMP-3.
 01 SOMEVALUE6 PIC 9(10) COMP-4.
 01 SOMEVALUE7 PIC 9(10) COMP-5.
 01 SOMEVALUE8 PIC 9(10) BINARY.