  IDENTIFICATION DIVISION.
 PROGRAM-ID. LVL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 DATA_2 PIC 9(8).
 01 FILLER PIC 9.
 02 MY-VAR PIC 9(1).
 LINKAGE SECTION.
 01 MY_VAR2 PIC 9(1).
 01 FILLER PIC 9.
 01 MY-VAR2 PIC 9(1).
 PROCEDURE DIVISION.
 TEST_SECTION SECTION.
 MY_PARAGRAPH.
 TEST-SECTION2 SECTION.
 MY-PARAGRAPH.