  IDENTIFICATION DIVISION.
 PROGRAM-ID. NOREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEM1 PIC S9(2) VALUE -10.
 01 ITEM1 PIC 9(2) VALUE 10.
 01 CONDITION1 PIC 9(2).
 	88 COND1 1, 2, 3.
 	88 COND2 4 THRU 10.
 LINKAGE SECTION.
 01 ITEM3 PIC A(2) VALUE 'AB'.
 01 ITEM4 PIC X(3) VALUE 'AB$'.
 LOCAL-STORAGE SECTION.
 01 ITEM5 PIC S9(2)V9(3) VALUE -10.123.
 01 ITEM6 PIC 9(2)V9 VALUE 10.1.