 IDENTIFICATION DIVISION.
 PROGRAM-ID. NOREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEM1 PIC S9(2) VALUE 10, 'A', 1.0.
 01 ITEM2 PIC 9(2) VALUE 'A'.
 LINKAGE SECTION.
 01 ITEM3 PIC A(2) VALUE 0.
 01 ITEM4 PIC X(3) VALUE 0.
 LOCAL-STORAGE SECTION.
 01 ITEM5 PIC S9(2)V9(3) VALUE 'AB$'.
 01 ITEM6 PIC 9(2)V9 VALUE -1.