  IDENTIFICATION DIVISION.
 PROGRAM-ID. LVL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77  COUNTER PIC 9(8).
 LINKAGE SECTION.
 77 MY_VAR PIC 9(1).
 PROCEDURE DIVISION.
