  IDENTIFICATION DIVISION.
 PROGRAM-ID. LVL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  MY_VAR1 OCCURS 2.
 01  MY_VAR2 PIC 9(9).
 LINKAGE SECTION.
 01 MY_VAR3 OCCURS 2.
 01 MY_VAR4 PIC 9V9.
 PROCEDURE DIVISION.
