  IDENTIFICATION DIVISION.
 PROGRAM-ID. NOREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 VARS.
 	05 VAR1 PIC 9(3) COMP-2.
 	05 TABLE1 OCCURS 1 TO 100 DEPENDING ON VAR1 PIC V9.
 	05 VAR2 PIC 9.
 	05 VAR3 PIC 9(8) DATE FORMAT YYYYXXXX.
 	05 TABLE2 OCCURS 1 TO 3 DEPENDING ON VAR2 PIC V9. 
 	05 TABLE3 OCCURS 1 TO 10 DEPENDING ON VAR3 PIC V9.               
