  IDENTIFICATION DIVISION.
 PROGRAM-ID. LVL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  COUNTER OCCURS 1.
 LINKAGE SECTION.
 01 MY_VAR OCCURS 1.
 PROCEDURE DIVISION.
