 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCR01.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
    01 ITEMOCC PICTURE X(10) OCCURS 1 TO 5 TIMES 
        DEPENDING ON SOMEOCCPARAM
        DESCENDING KEY IS SOMEKEY1 SOMEKEY2
        ASCENDING KEY IS SOMEKEY3
        INDEXED BY LOCAL SOMEINDEX1 SOMEINDEX2.
    