 IDENTIFICATION DIVISION.
 PROGRAM-ID. LKGSCTENTRYWTHVAL.
 DATA DIVISION.
 LINKAGE SECTION.
 01 SOME-DATA1 PIC 999V9 COMP-3.
 01 SOME-DATA2 PIC 99V9 COMP-3.
 01 SOME-DATA3 PIC 999V9(4) COMP-3.
 WORKING-STORAGE SECTION.
 01 SOME-DATA4 PIC 9(2) COMP-3.
 01 SOME-DATA5 PIC 999V9 COMP-3.
 01 SOME-DATA6 PIC 9(4)V9(3) COMP-3.
 
 