  IDENTIFICATION DIVISION.
 PROGRAM-ID. NOREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  COUNTER PIC 9(8).
 LINKAGE SECTION.
 01 MY_VAR PIC 9(1).
 PROCEDURE DIVISION.
