  IDENTIFICATION DIVISION.
 PROGRAM-ID. NOREDEFINES.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEM1 TYPEDEF PIC S9(2) VALUE 10.
 01 ITEM2 PIC 9(2) VALUE 10.
 LINKAGE SECTION.
 01 ITEM3 TYPEDEF PIC S9(2) VALUE 10.
 01 ITEM4 PIC 9(2) VALUE 10.
 LOCAL-STORAGE SECTION.
 01 ITEM5 TYPEDEF PIC S9(2) VALUE 10.
 01 ITEM6 PIC 9(2) VALUE 10.