 IDENTIFICATION DIVISION.
 PROGRAM-ID. foo.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 DATA-BLOCK-1 PIC X(42).   
    02 SOME-DATA-1 PIC X(21).
    02 SOME-DATA-2 PIC X(21).

  01 DATA-BLOCK-2 PIC X(100).  
    02 SOME-DATA-3 PIC X(50).
    02 SOME-DATA-4 PIC X(50).
    
  01 FILLER PIC X(5).   		
  
  01 DATA-BLOCK-3.  		
  	02 DATA-2 PIC X(10).
  	02 DATA-3 PIC X(10).
  	02 DATA-4 PIC 9 VALUE 1.
	
  01 SOME-DATA-5 PIC X(10). 


 PROCEDURE DIVISION.
 MOVE "TEST" TO SOME-DATA-1.
