 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMSECTION.
 PROCEDURE DIVISION.
 SOME-SECTION-1 SECTION.
    GO TO PROC5.
 SOME-SECTION-2 SECTION.
 PROC5.