 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMBOTH.
 PROCEDURE DIVISION.
 SOME-SECTION-1 SECTION.
 INIT.
     PERFORM PROC1 THROUGH PROC3.
     STOP RUN.
 PROC1.
 PROC2.
     GO TO PROC4.
 PROC3.
 SOME-SECTION-2 SECTION.
 PROC4.