 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMPROCEDURETHROUGH.
 PROCEDURE DIVISION.
 INIT.
     PERFORM PROC1 THROUGH PROC3.
     STOP RUN.
 PROC1.
 PROC2.
     GO TO PROC4.
 PROC3.
 PROC4.