 IDENTIFICATION DIVISION.
 PROGRAM-ID. DIVSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 42.
 77 SOMEID2 PIC 9(10) VALUE 10.
 PROCEDURE DIVISION.
    DIVIDE 2 INTO SOMEID1 SOMEID2.
