 IDENTIFICATION DIVISION.
 PROGRAM-ID. MERGESTMT.
 PROCEDURE DIVISION.
 READ DF-PARAM-SPILOTE AT END
  GO TO F-LECT-SPILOTE
 END-READ.
 READ DF-PARAM-SPILOTE AT END
  GO TO F-LECT-SPILOTE.
 PERFORM PROC1 
       WITH TEST 
       AFTER UNTIL 1=1.
 CALL SOMEPROG1
 	USING
 	BY REFERENCE SOMEPARAM1 SOMEPARAM3.
 DELETE SOMEFILE RECORD.
 EVALUATE SOMEAGE ALSO SOMEAGE2 ALSO SOMEAGE3
       WHEN 0 THROUGH 25 PERFORM SOMEPROC1
       WHEN 25 THROUGH 50 PERFORM SOMEPROC2
       WHEN 50 THROUGH 74 ALSO 75 PERFORM SOMEPROC3
       WHEN OTHER PERFORM SOMEPROC4.
 IF SOMECOND1 THEN
       DISPLAY 'thentext'
    ELSE
       DISPLAY 'elsetext'
    END-IF.
 REWRITE SOMERECORD1
       FROM SOMEID1
       INVALID KEY DISPLAY 'invalid key'
       NOT INVALID KEY DISPLAY 'not invalid key'.
       	
 