 IDENTIFICATION DIVISION.
 PROGRAM-ID.  OBSOLETE.
 AUTHOR.  STEFAN STAWIARSKI.
 INSTALLATION.
 DATE-WRITTEN. 14.03.2018.
 DATE-COMPILED. 14.03.2018.
 SECURITY. NONE.
 
 ENVIRONMENT DIVISION. 

 CONFIGURATION SECTION.
 SOURCE-COMPUTER. IBM-I WITH DEBUGGING MODE.
 OBJECT-COMPUTER. IBM-I MEMORY SIZE 0 CHARACTERS.
 
 INPUT-OUTPUT SECTION. 
	FILE-CONTROL.
      SELECT SOMEFILE1 ASSIGN TO 'somefile1.txt'.
      SELECT SOMEFILE2 ASSIGN TO 'somefile2.txt'
      PADDING CHARACTER IS "right".

 I-O-CONTROL. 
 RERUN EVERY 2
 MULTIPLE FILE SOMEFILE1 POSITION 2.

 DATA DIVISION. 
 FILE SECTION. 
 	FD SOMEFILE1  
 		DATA RECORD IS DATA-NAME
 		LABEL RECORDS ARE STANDARD.
 	FD SOMEFILE2
 	  VALUE OF SYSNAME IS "SOMENAME".	
 WORKING-STORAGE SECTION. 
 LINKAGE SECTION. 

 PROCEDURE DIVISION.
    DECLARATIVES.
       SOMESECTION1 SECTION.
          USE FOR DEBUGGING ON ALL REFERENCES OF SOMEID1
                               ALL PROCEDURES
                               SOMEPROC1.
       SOMESECTION2 SECTION.
          USE GLOBAL AFTER EXCEPTION PROCEDURE ON SOMEFILE1.
    END DECLARATIVES.
    
 PARAGRAPH-ALTER-1.
     PERFORM BYPASS-PARAGRAPH.
   PARAGRAPH-ALTER-2.
   BYPASS-PARAGRAPH.
    ALTER PARAGRAPH-1 TO PROCEED TO PARAGRAPH-2.
    
  PARAGRAPH-ENTER.
   ENTER LANGUAGE-NAME ROUTINE-NAME.
  
  PARAGRAPH-OPEN-REVERSED.
      OPEN
       INPUT 
          SOMEFILE1 WITH NO REWIND
          SOMEFILE2 REVERSED.
          
  PARAGRAPH-DEBUG-ITEM.
   	MOVE 1 TO  DEBUG-ITEM.
   	
  PARAGRAPH-STOP-LITERAL.
  	STOP RUN.
    STOP 'someliteral'.
  	
  PARAGRAPH-GOTO. 
    GO TO PARAGRAPH.	
   	GO TO SOMEPROC3 SOMEPROC4 SOMEPROC5 DEPENDING ON SOMEDATA1.