 IDENTIFICATION DIVISION.
 PROGRAM-ID. MERGESTMT.
 PROCEDURE DIVISION.
 MOVE 1 TO SOMEVAL MOVE 2 TO SOMEVAL.
 IF SOMEVAL > 0 THEN DISPLAY "positive".
 