 IDENTIFICATION DIVISION.
 PROGRAM-ID. TERMINATESTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10).
 PROCEDURE DIVISION.
    SEND TO TOP SOMEID1
       ON EXCEPTION DISPLAY "Test".