 IDENTIFICATION DIVISION.
 PROGRAM-ID. MAIN.

 DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-STUDENT-ID PIC 9(4) VALUE 1000.

 PROCEDURE DIVISION.
   DISPLAY 'Student Id : ' WS-STUDENT-ID
   CALL 'UTIL' GIVING WS-STUDENT-ID.
   DISPLAY 'Student Id : ' WS-STUDENT-ID
 STOP RUN.