 IDENTIFICATION DIVISION.
 PROGRAM-ID. CALLSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEPARAM1 PIC X(10) VALUE "PARAM1".
 01 SOMEPARAM2 PIC X(10).
 77 SOMEPARAM3 PICTURE S9  VALUE ZERO.
 PROCEDURE DIVISION.
	CALL SOMEPROG2
       USING SOMEPARAM1.
    CALL SOMEPROG2
       USING SOMEPARAM2.
    CALL SOMEPROG2
    		USING SOMEPARAM3.
    CALL SOMEPROG1
       USING
          BY REFERENCE SOMEPARAM1 SOMEPARAM2.