 IDENTIFICATION DIVISION.
 PROGRAM-ID. CALLSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEPARAM1 PIC X(10) VALUE "PARAM1".
 01 SOMEPARAM2 PIC X(10).
 LINKAGE SECTION.
 01 SOMEPARAM3 PIC X(10).
 PROCEDURE DIVISION.
	MOVE SPACES TO SOMEPARAM7.
	INITIALIZE SOMEPARAM7.
	CALL SOMEPROG2
       USING SOMEPARAM1.
    CALL SOMEPROG2
       USING SOMEPARAM2.
    CALL SOMEPROG2
       USING SOMEPARAM3.