 IDENTIFICATION DIVISION.
 PROGRAM-ID. CALLSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEPROG1 PIC X(10) VALUE "SUB1".
 01 SOMEPROG2 PIC X(10) VALUE "SUB2".
 PROCEDURE DIVISION.
	MOVE "SMELL" TO SOMEPROG2.
    CALL SOMEPROG1.
    CALL SOMEPROG2.     