 IDENTIFICATION DIVISION.
 PROGRAM-ID. CALLSTMT.
 PROCEDURE DIVISION.
    CALL "SOMEPROG1".
    CALL "SOMEPROG2".
    CALL "SOMEPROG3".
    CALL "SOMEPROG4".
    CALL "SOMEPROG5".
    CALL "SOMEPROG6".
    CALL "SOMEPROG7".
    CALL "SOMEPROG8".
    CALL "SOMEPROG9".
    CALL "SOMEPROG10".
    CALL "SOMEPROG11".

