 IDENTIFICATION DIVISION.
 PROGRAM-ID. SETTOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PICTURE IS X(9).
 77 SOMEID2 PICTURE IS X(9).
 PROCEDURE DIVISION.
    SET SOMEID1 TO 'test'.
    SET SOMEID2 TO True.