 IDENTIFICATION DIVISION.
 PROGRAM-ID.  OBSOLETE.
 PROCEDURE DIVISION.
 PARAGRAPH-ALTER-1.
     PERFORM BYPASS-PARAGRAPH.
   PARAGRAPH-ALTER-2.
   BYPASS-PARAGRAPH.
    ALTER PARAGRAPH-1 TO PROCEED TO PARAGRAPH-2.
