 IDENTIFICATION DIVISION.
 PROGRAM-ID.  OBSOLETE.
 PROCEDURE DIVISION.
    GO TO PARAGRAPH.	
   	GO TO SOMEPROC3 SOMEPROC4 SOMEPROC5 DEPENDING ON SOMEDATA1.