 IDENTIFICATION DIVISION.
 PROGRAM-ID.  OBSOLETE.
 
 ENVIRONMENT DIVISION. 
 
 INPUT-OUTPUT SECTION. 
 
 I-O-CONTROL. 
 MULTIPLE FILE SOMEFILE1 POSITION 2.