 IDENTIFICATION DIVISION.
 PROGRAM-ID.  OBSOLETE.

 ENVIRONMENT DIVISION. 
 INPUT-OUTPUT SECTION. 
	FILE-CONTROL.
      SELECT SOMEFILE1 ASSIGN TO 'somefile1.txt'.
      SELECT SOMEFILE2 ASSIGN TO 'somefile2.txt'
      PADDING CHARACTER IS "right".