 IDENTIFICATION DIVISION.
 PROGRAM-ID.  OBSOLETE.

 PROCEDURE DIVISION.

  PARAGRAPH-OPEN-REVERSED.
      OPEN
       INPUT 
          SOMEFILE1 WITH NO REWIND
          SOMEFILE2 REVERSED.
