 IDENTIFICATION DIVISION.
 PROGRAM-ID.  OBSOLETE.
 PROCEDURE DIVISION.
    DECLARATIVES.
       SOMESECTION1 SECTION.
          USE FOR DEBUGGING ON ALL REFERENCES OF SOMEID1
                               ALL PROCEDURES
                               SOMEPROC1.
       SOMESECTION2 SECTION.
          USE GLOBAL AFTER EXCEPTION PROCEDURE ON SOMEFILE1.
    END DECLARATIVES.
