 IDENTIFICATION DIVISION.
 PROGRAM-ID. MERGESTMT.
 PROCEDURE DIVISION.
  PARAGRAPH-1.
     PERFORM BYPASS-PARAGRAPH.
     GO TO BYPASS-PARAGRAPH.
   PARAGRAPH-1A.
   BYPASS-PARAGRAPH.
    ALTER PARAGRAPH-1 TO PROCEED TO PARAGRAPH-2.
  PARAGRAPH-2.