 ID DIVISION.
  PROGRAM-ID. DCML.
 DATA DIVISION.
  WORKING-STORAGE SECTION.
   01 ITEMNUMERIC VALUE 23.4.
 PROCEDURE DIVISION.
  DISPLAY ITEMNUMERIC.