 ID DIVISION.
  PROGRAM-ID. DCML.
 ENVIRONMENT DIVISION.
  CONFIGURATION SECTION.
   SPECIAL-NAMES.
    DECIMAL-POINT IS COMMA.
 DATA DIVISION.
  WORKING-STORAGE SECTION.
   01 ITEMNUMERIC VALUE 23.4.
 PROCEDURE DIVISION.
  DISPLAY ITEMNUMERIC.