 IDENTIFICATION DIVISION.
 PROGRAM-ID. CMPTESTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10).
 PROCEDURE DIVISION.
    COMPUTE SOMEID1 = 2 * 2.