 IDENTIFICATION DIVISION.
 PROGRAM-ID. CMPTESTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 23.
 77 SOMEID2 PIC 9(10).
 PROCEDURE DIVISION.
    COMPUTE SOMEID2 = 2 * SOMEID1.