 IDENTIFICATION DIVISION.
 PROGRAM-ID. CONFIGSECTION.
 ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
       SOURCE-COMPUTER. XYZ WITH DEBUGGING MODE.
       OBJECT-COMPUTER. ZYX.
           