 IDENTIFICATION DIVISION.
 PROGRAM-ID. IDEAO.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMECOND1 PIC X.
   88 VAR1 VALUE "VAR1".
   88 VAR2 VALUE "VAR2".
   88 VAR3 VALUE "VAR3".
   88 VAR4 VALUE "VAR4".
 01 SOMEVAR PIC X VALUE "SOMEVAR".

 PROCEDURE DIVISION.
    IF VAR1 THEN
       DISPLAY 'thentext'
       END-IF.
    IF SOMECOND1 = "VAR1" THEN
       DISPLAY 'thentext'
       END-IF.
	IF SOMEVAR = "SOMEVAR" THEN
       DISPLAY 'thentext'
       END-IF.
    IF SOMECOND1 = "VAR4" THEN
       DISPLAY 'thentext'
       END-IF.
    IF SOMEVAR = SOMECOND5 THEN
       DISPLAY 'thentext'
       END-IF.
   