 IDENTIFICATION DIVISION.
 PROGRAM-ID. IDEAO.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
   01 SOMECOND1 PIC 9(20).
   01 SOMECOND2 PIC 9(20).
   01 SOMECOND3 PIC 9(20).
 PROCEDURE DIVISION.
   COMPUTE SOMECOND3 = SOMECOND1 / SOMECOND1.
   COMPUTE SOMECOND2 = 3 - 3.
   COMPUTE SOMECOND2 = 2 / 2.
   COMPUTE SOMECOND2 = SOMECOND3 - 3.
   COMPUTE SOMECOND1 = SOMECOND2 + SOMECOND3.
   