 IDENTIFICATION DIVISION.
 PROGRAM-ID. IDEAO.
 PROCEDURE DIVISION.
    IF 1 > 2 OR 1 < 2 THEN
       DISPLAY 'thentext'
       END-IF.
    IF 2 = 2 OR 1 = 1 THEN
       DISPLAY 'thentext'
       END-IF.
	IF 2 = 1 OR 2 = 1 THEN
       DISPLAY 'thentext'
       END-IF.
   