 IDENTIFICATION DIVISION.
 PROGRAM-ID. IDEAO.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
   01 SOMECOND1 PIC 9(2)V9(12).
   01 SOMECOND2 PIC 9(20)V9(12).
   01 SOMECOND3 PIC 9(20)V9(13).
   01 SOMECOND4 PIC X(15).
   01 SOMECOND5 PIC X(20).
 PROCEDURE DIVISION.
    IF SOMECOND1 > SOMECOND2 THEN
       DISPLAY 'thentext'
       END-IF.
    IF SOMECOND1 = SOMECOND3 THEN
       DISPLAY 'thentext'
       END-IF.
	IF SOMECOND2 = SOMECOND3 THEN
       DISPLAY 'thentext'
       END-IF.
    IF SOMECOND4 = SOMECOND1 THEN
       DISPLAY 'thentext'
       END-IF.
    IF SOMECOND4 = SOMECOND5 THEN
       DISPLAY 'thentext'
       END-IF.
   