 IDENTIFICATION DIVISION.
 PROGRAM-ID. VALIDVALUE.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 VALIDITEM1 PIC 99.9 VALUE 42.
 01 VALIDITEM2 PIC 99 VALUE 42.
 01 VALIDITEM3 PIC X(5) VALUE "test".
 01 VALIDITEM4 PIC 99 VALUE ZERO.