 IDENTIFICATION DIVISION.
 PROGRAM-ID. LKGSCTENTRYWTHVAL.
 DATA DIVISION.
 LINKAGE SECTION.
 01 SOME-DATA1 PIC 999V9.
 01 SOME-DATA2 PIC 99V9.
 01 WS-DATA1 PIC 999V9(4).
 WORKING-STORAGE SECTION.
 01 WS-DATA2 PIC 9(2).
 01 WS-123456 PIC 999V9.
 01 SOME-DATA6 PIC 9(4)V9(3).
 02 SOME-DATA6 PIC 9(4)V9(3).