 IDENTIFICATION DIVISION.
 PROGRAM-ID. EXAMPLE.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 COMPANY.
    05 COMPANY-NAME PIC X(60) VALUE "Semantic Designs".
    05 COMPANY-ADDRESS.
       10 STREET PIC X(80) VALUE "13171 Pond Springs Rd.".
       10 CITY.
   15 CITY-NAME PIC X(40) VALUE "Austin".
   15 FILLER PIC XX VALUE ", ".
   15 CITY-STATE PIC XX VALUE "TX".
          15 ZIP.
             20 ZIP-5  PIC 9(5) VALUE 78729.
             20 FILLER PIC X    VALUE "-".
             20 ZIP-E4 PIC 9(4) VALUE 7102.
 01 LINE-ITEM.
    05 ITEM PIC X(20)     VALUE "Item Description".
    05 QUANTITY PIC 999   VALUE 217.
    05 PRICE PIC 9999V99  VALUE 24.95.

 77 TOTAL-AMOUNT PIC 999999V99.
 77 DISCOUNT-THRESHOLD PIC 999999V99 VALUE 1111.11.
 77 DISCOUNT-PERCENT   PIC 99 VALUE 20.
 77 DISCOUNT-AMOUNT    PIC 99999999V99.

 PROCEDURE DIVISION.
 PERFORM-TASK.
   PERFORM COMPUTE-TOTAL.
   PERFORM DISPLAY-TOTAL.
   STOP RUN.
 COMPUTE-TOTAL.
   MULTIPLY QUANTITY BY PRICE GIVING TOTAL-AMOUNT.
   IF TOTAL-AMOUNT > DISCOUNT-THRESHOLD
     MULTIPLY TOTAL-AMOUNT BY DISCOUNT-PERCENT
       GIVING DISCOUNT-AMOUNT
     DIVIDE 100 INTO DISCOUNT-AMOUNT
     SUBTRACT DISCOUNT-AMOUNT FROM TOTAL-AMOUNT.
 DISPLAY-TOTAL.
   DISPLAY COMPANY-NAME.
   DISPLAY "Total: ", TOTAL-AMOUNT.