 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 42.
 PROCEDURE DIVISION.
     SUBTRACT 1 FROM SOMEID1.