 IDENTIFICATION DIVISION.
 PROGRAM-ID. SUBTRSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 42.
 77 SOMEID2 PIC 9(10) VALUE 23.
 PROCEDURE DIVISION.
     SUBTRACT 1 2 FROM SOMEID1 SOMEID2.