 IDENTIFICATION DIVISION.
 PROGRAM-ID. ARITHEXPR.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
    01 SOMEID1 PIC 9(20).
 PROCEDURE DIVISION.
    COMPUTE SOMEID1 = 15 / 3 + 2.