 IDENTIFICATION DIVISION.
 PROGRAM-ID. GOTOLOOPSTMT.
 PROCEDURE DIVISION.
 SOMEPROC1.
    DISPLAY 'test'.
    GO TO SOMEPROC1.
 SOMEPROC2.
    DISPLAY 'test2'.
    GO TO SOMEPROC1.
