 IDENTIFICATION DIVISION.
 PROGRAM-ID. EVALSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEAGE PIC 9(10) VALUE 44.
 77 SOMEID2 PIC 9(10).
 PROCEDURE DIVISION.
    EVALUATE SOMEAGE
       WHEN 0 THROUGH 25 MOVE 1 TO SOMEID2
       WHEN 25 THROUGH 50 MOVE 2 TO SOMEID2
       WHEN 50 THROUGH 74 ALSO 75 MOVE 3 TO SOMEID2
       WHEN OTHER MOVE 4 TO SOMEID2
    END-EVALUATE.