 IDENTIFICATION DIVISION.
 PROGRAM-ID. EVALSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10).
 PROCEDURE DIVISION.
    EVALUATE TRUE
       WHEN FALSE MOVE 10 TO SOMEID1
       WHEN TRUE MOVE 20 TO SOMEID1
    END-EVALUATE.