 IDENTIFICATION DIVISION.
 PROGRAM-ID. EVALSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10).
 PROCEDURE DIVISION.
    EVALUATE FALSE
       WHEN NOT FALSE MOVE 15 TO SOMEID1
       WHEN NOT TRUE MOVE 30 TO SOMEID1
    END-EVALUATE.