 IDENTIFICATION DIVISION.
 PROGRAM-ID. VALUESTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 GENDER PIC X.
    88  MALE   VALUE "M".
    88  FEMALE VALUE "F".
 PROCEDURE DIVISION.
    SET FEMALE TO TRUE.
    IF MALE THEN DISPLAY 'male' END-IF.
    IF FEMALE THEN DISPLAY 'female' END-IF.