 IDENTIFICATION DIVISION.
 PROGRAM-ID. SETTOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
     01 COUNTER PIC 9(2) VALUE 1.
 PROCEDURE DIVISION.
    SET COUNTER UP BY 2.