 IDENTIFICATION DIVISION.
 PROGRAM-ID. SETTOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 GENDER PIC X.
    88  MALE   VALUE "M".
    88  FEMALE VALUE "F".
 PROCEDURE DIVISION.
    SET FEMALE TO TRUE.
