 IDENTIFICATION DIVISION.
 PROGRAM-ID. SETTOSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 ITEMS.
    02 ITEM1 PIC X(10).
    02 ITEM2 PIC X(10).
 PROCEDURE DIVISION.
    SET ITEMS TO 'abcdefghijklmnopqrst'.