 IDENTIFICATION DIVISION.
 PROGRAM-ID. PERFORMINLINEUNTIL.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 0.
 PROCEDURE DIVISION.
   PERFORM 
     WITH TEST BEFORE 
     UNTIL SOMEID1=3 
       ADD 1 TO SOMEID1
       DISPLAY "Test" 
   END-PERFORM.