 IDENTIFICATION DIVISION.
 PROGRAM-ID. CLSSTMT.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT SOMEFILE1 ASSIGN TO 'somefile1a.txt'.
 PROCEDURE DIVISION.
    OPEN INPUT SOMEFILE1 WITH NO REWIND.
    CLOSE SOMEFILE1 WITH LOCK.