 IDENTIFICATION DIVISION.
 PROGRAM-ID. DATADESCR01.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 PROCEDURE DIVISION.
    IF ITEM1
       DISPLAY 'empty'.