 IDENTIFICATION DIVISION.
 PROGRAM-ID. DISPLAYSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 PROCEDURE DIVISION.
     DISPLAY 'ProLeap'.
     DISPLAY 'Nitro'.