 IDENTIFICATION DIVISION.
 PROGRAM-ID. MULTSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 77 SOMEID1 PIC 9(10) VALUE 10.
 PROCEDURE DIVISION.
    MULTIPLY 3 BY 2 GIVING SOMEID1.