 IDENTIFICATION DIVISION.
 PROGRAM-ID. IFNXTST.
 DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 NUM1 PIC 9 VALUE 5.
   01 NUM2 PIC 9 VALUE 2.
   01 DIV PIC 9.
   01 EVEN PIC 9. 
 PROCEDURE DIVISION.
   DIVIDE NUM1 BY NUM2 GIVING DIV REMAINDER EVEN.
   IF EVEN = 1
   	NEXT SENTENCE
   ELSE
   	STOP RUN.